app/Controllers/Register.php

INSERT INTO `user` (`nama_lengkap`, `username`, `password`, `alamat`, `nomor_telepon`, `level_user`, `otp`) VALUES ('Dwi Fatma', 'Fatma', '717b181ecc48e800f2af5a43a4d58d9c', 'Ngawi', '089522167387', 'Pelanggan', 76331)
---
	public function save()
	{
		//include helper form
		helper(['form']);
		//set rules validation form
		$rules = [
			'name' 			=> 'required|min_length[3]|max_length[20]',
		];
		// get method post
		if ($this->request->getMethod() == 'post') {
			$this->modelUser = new ModelUser();
			// data user dan password
			$nama_lengkap 	= htmlspecialchars($this->request->getPost('nama'));
			$username	= htmlspecialchars($this->request->getPost('username'));
			$password = htmlspecialchars(md5($this->request->getPost('password')));
			$alamat	= htmlspecialchars($this->request->getPost('alamat'));
			$nomor_telepon	= htmlspecialchars($this->request->getPost('nomor_telepon'));
			$level_user	= htmlspecialchars($this->request->getPost('level_user'));
			// $otp	= htmlspecialchars($this->request->getPost('otp'));
			// input data register ke dalam database user
			$otp = random_int(10000,99999);
			$this->modelUser->insert([
				'nama_lengkap' 	=> $nama_lengkap,
				'username' 	=> $username,
				'password' => $password,
				'alamat' 	=> $alamat,
				'nomor_telepon' 	=> $nomor_telepon,
				'level_user' => 'Pelanggan',
				'otp' => $otp,
			]);