app/Controllers/Reservasi.php

SELECT *
FROM `reservasi`
WHERE `reservasi`.`id_reservasi` = '62'
SELECT *
FROM `user`
WHERE `user`.`user_id` = '74'
---
    public function edit($id_reservasi)
    {
        $isAdmin = $this->checkLogin();
        if(!$isAdmin) { return redirect()->to(base_url('layout/login')); }

        $data['notifikasi'] = $this->notifikasiModel->getData();
        $data['dataReservasi'] = $this->reservasiModel->find($id_reservasi);
        $data['user'] = $this->userModel->find($data['dataReservasi']['user_id']);

SELECT *
FROM `reservasi`
WHERE `reservasi`.`id_reservasi` = '62'
SELECT *
FROM `user`
WHERE `user`.`user_id` = '74'
---
    public function update($id_reservasi)
    {
        $reservasi = $this->reservasiModel->find($id_reservasi);
        $user = $this->userModel->find($reservasi['user_id']);