app/Models/ModelUser.php

SELECT *
FROM `user`
WHERE `username` = 'Oktavia'
AND `password` = 'fddb5ebe00d8efcb1bdfc3dbb4faae12'
 LIMIT 1
---
    public function login($username, $password)
    {
        return $this->where(['username' => $username, 'password' => $password])->first();

SELECT *
FROM `user`
WHERE `user`.`user_id` = '74'
---
    public function getUserById($id)
    {
        return $this->find($id);