app/Models/ReservasiModel.php

    public function updateReservasi($id, $data)
    {
        $this->db->table('reservasi')->where('id_reservasi', $id)->update($data);
---
UPDATE `reservasi` SET `status_reservasi` = 'Selesai'
WHERE `id_reservasi` = '62'